# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# 70 = 2*5*7 => [2, 5, 7]
# 140 = 2*2*5*7 => [2, 2, 5, 7]
# 140|2
#  70|2
#  35|5
#   7|7

n = int(input("Введите число N => "))
i = 2
my_list = []
n_initial = n
while i <= n:
    if n % i == 0:
        my_list.append(i)
        n //= i
        i = 2
    else:
        i += 1

print(f"Простые множители числа {n_initial} => {my_list}")
