# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат
# точек в этой четверти (x и y).

Quarter_number = int(input('Введите номер четверти => '))

if (Quarter_number == 1):
    print('х = от [1;+бесконечность) и у = [1;+бесконечность)')
if (Quarter_number == 2):
    print('х = от [-1;-бесконечность) и у = [1;+бесконечность)')
if (Quarter_number == 3):
    print('х = от [-1;-бесконечность) и у = [1;-бесконечность)')
if (Quarter_number == 4):
    print('х = от [1;+бесконечность) и у = [1;-бесконечность)')
if (Quarter_number > 4 or Quarter_number < 1):
    print('Введеной четверти не существует')
